#include <iostream>
#include <cmath> // для sqrt(x) - квадратный корень, pow(x, y) - x в степень y, NAN (Not A Number) - значение, если x вышел за границы графика, isnan(y) - функция, проверяет, является ли значение "не числом"
#include <iomanip> // setw(n) - устанавливает ширину след.поля вывода в n символов (| стоят друг за другом), fixed - вывод чисел в обычном десятичном виде, setprecision(n) - устанавливает кол-во знаков после запятой

using namespace std;

// Функция вычисления значения y в зависимости от x
double calculateY(double x) {
    if (x >= -5.0 && x <= -3.0) {
        // Уравнение четверти окружности: y = sqrt(R^2 - (x - x0)^2)
        // R = 2, центр в точке (-3, 0)
        return sqrt(4.0 - pow(x + 3.0, 2));
    }
    else if (x > -3.0 && x <= -2.0) {
        // Уравнение прямой по двум точкам (-3, 2) и (-2, 1)
        // y = -x - 1
        return - x - 1.0;
    }
    else if (x > -2.0 && x <= -1.0) {
        // Верхняя четверть окружности: y = sqrt(R^2 - (x - x0)^2)
        // R = 1, центр в точке (2, -1)
        return sqrt(1.0 - pow((x + 2.0), 2));
    }
    else if (x > -1.0 && x <= 1.0) {
        // Уравнение прямой по двум точкам (-1, 0) и (1, -1)
        // y = -0.5x - 0.5
        return -0.5 * x - 0.5;
    }
    else if (x > 1.0 && x <= 2.0) {
        // Нижняя четверть окружности: y = b - sqrt(R^2 - (x - x0)^2)
        // R = 1, центр в точке (2, -1)
        return -1.0 - sqrt(1.0 - pow((x - 2.0), 2));
    }
    else if (x > 2.0 && x <= 3.0) {
        // Уравнение прямой
        // y = -x
        return -x;
    }
    else if (x > 3.0 && x <= 5.0) {
        // Четверть окружности: y = b + sqrt(R^2 - (x - x0)^2)
        // R = 2, центр в точке (5, -3)
        return -3.0 + sqrt(4.0 - pow(x - 5.0, 2));
    }
    else {
        // Значение x вне интервала [-5, 5]
        return NAN;
    }
}

int main() {
    // Исходные данные
    double x_start = -5.0;
    double x_end = 5.0;
    double dx = 0.5;

    // Вывод шапки таблицы
    cout << "-------------------------" << endl;
    cout << "|" << setw(8) << "X" << " |" << setw(12) << "Y" << " |" << endl;
    cout << "-------------------------" << endl;

    // Цикл вычисления вывода и значений
    // + dx/10.0 используется для компенсации погрешности чисел с плавающей точкой
    for (double x = x_start; x <= x_end + dx / 10.0; x += dx) {
        double y = calculateY(x);

        cout << "|" << setw(8) << fixed << setprecision(2) << x << " |";

        if (isnan(y)) {
            cout << setw(12) << "N/A" << " |" << endl;
        }
        else {
            cout << setw(12) << fixed << setprecision(4) << y << " |" << endl;
        }
    }

    cout << "-------------------------" << endl;
    return 0;
}